export const howToGetProthesis = {
  title: "Способы получения протеза в России",
  content: {
    // при добавлении нового заголовка, можно дать любое название, главное чтобы он содержал слово "subheading"
    title_1: "Этапы протезирования",
    // при добавлении нового параграфа, можно дать ключу любое название, главное чтобы он содержал слово "paragraph"
    paragraph_1: `1. Консультация специалиста-инженера по протезированию для выбора подходящего протеза 
    2. Получение медико-технического заключения (МТЗ) с рекомендацией использования протеза и сопровождение процедур медико-социальной экспертизы
    3. Создание индивидуальной программы реабилитации (ИПРА) с учетом необходимого технического средства
    4. Поиск финансирования через благотворительные фонды, государственные контракты или беспроцентные займы для изготовления протеза
    5. Процесс протезирования на базе специализированных предприятий в вашем регионе
    6. Возможность компенсации средств за протезирование со стороны Фонда социального страхования`,
    title_2: "Типы компенсаций",
    paragraph_7: `Согласно постановлению Правительства РФ от 7 апреля 2008 года № 240, все граждане с инвалидностью имеют право на бесплатное протезирование в рамках индивидуальной программы реабилитации (ИПРА).`,
    paragraph_8: `Доступны три способа получения технических средств реабилитации (ТСР) за счет средств из федерального бюджета:`,
    subheading_1: `1. Государственный контракт`,
    paragraph_10: `Для получения протеза по государственному контракту требуется предоставить следующие документы: ИПРА, Паспорт РФ (свидетельство о рождении), СНИЛС.
    Обратиться за государственным контрактом можно в местное отделение Социального фонда России (СФР) или через портал Госуслуги.
    Сроки получения протеза варьируются от 2 до 12 месяцев.
    Государственные контракты на предоставление технических средств реабилитации организуются с учетом потребностей граждан.
    Ожидание поступления средств для организации конкурса может занять от 2 до 12 месяцев.
    Согласно законодательству о государственных закупках, контракт заключается на основе результатов торгов.
    Победителем становится компания, предложившая наиболее выгодные условия.
    Однако каждый имеет возможность просить о заключении контракта с организацией, предоставившей МТЗ.
    Исходя из нашего опыта, обычно контракт выигрывает выбранный вами поставщик.
    Но если вам не повезло, всегда есть возможность отказаться от данного метода и выбрать другие варианты финансирования.`,
    subheading_2: `2. Электронный сертификат`,
    paragraph_12: `Для получения протеза посредством электронного сертификата потребуются следующие документы: паспорт РФ (свидетельство о рождении ребенка), ИПРА и карта МИР.
    Обратиться за электронным сертификатом можно в местное отделение Социального фонда России (СФР) или через портал Госуслуги. Сроки получения протеза по данному методу составляют до 2 месяцев.
    С осени 2021 года начало действовать новое Постановление Правительства Российской Федерации от 29.04.2021 № 678, предусматривающее оплату технических средств реабилитации через электронный сертификат. 
    Сумма сертификата будет зависеть от региона.
    В информационной системе будут собраны данные о доступных средствах реабилитации, которые можно приобрести по электронному сертификату. 
    Эту платформу синхронизируют с порталом госуслуг, через который можно будет подавать заявления на получение электронных сертификатов.
    К сожалению, на данный момент возможность получить протезы верхних и нижних конечностей посредством сертификата представлена не во всех регионах.
    Срок действия электронного сертификата определяется программой реабилитации, но не превышает 12 месяцев с момента начала его действия. 
    В любое время у вас есть возможность отказаться от полученного сертификата и выбрать другие способы получения протеза.`,   
    subheading_3: `3. Государственная компенсация`,
    paragraph_13: `Необходимые документы: ИПРА, Паспорт РФ (свидетельство о рождении ребенка), СНИЛС, Документы, подтверждающие расходы, Паспорт изделия, Копия сертификата соответствия.
    Место обращения: местное отделение Социального фонда России (СФР) или портал Госуслуги.
    Сроки получения протеза: до 2 месяцев.
    Этот метод позволяет быстро и просто получить тяговый протез для граждан России. 
    Стоимость протеза компенсируется Фондом социального страхования после его получения.
    Выбирая протезную организацию самостоятельно, вы можете получить компенсацию от государства после получения протеза, что значительно ускоряет процесс.
    Для использования этого способа оплаты необходимо предварительно оплатить протез собственными средствами.`
},
};
