import image1 from "../../public/images/typeOfProthesis_1.jpg";
import image2 from "../../public/images/typeOfProthesis_2.jpg";
import image3 from "../../public/images/typeOfProthesis_3.jpg";
import image4 from "../../public/images/typeOfProthesis_4.jpg";

export const typesOfProthesis = {
  title: "Разновидности протезов рук",
  content: {
    // при добавлении новой карттинки, можно дать ключу любое название, главное чтобы она содержала слово "image"
    image_1: image1,
    // при добавлении нового заголовка, можно дать любое название, главное чтобы он содержал слово "subheading"
    title_1: "Косметические",
    // при добавлении нового параграфа, можно дать ключу любое название, главное чтобы он содержал слово "paragraph"
    paragraph_1: `Главное предназначение этого протеза - визуальная замена утраченной конечности. Он имитирует естественную руку, но его функциональные возможности ограничены.

        Косметические протезы созданы для улучшения внешнего вида. Поэтому в некоторых компаниях работают скульпторы и художники, которые создают протезы, максимально похожие на вашу руку.

        В России, не так много предприятий, которые имеют свое производство косметических протезов и оболочек.

        На сегодняшний день существуют компании которые создают косметические (пассивные) протезы без оболочки имитирующей кожу человека, такие протезы больше похожи на футуристическую руку робота, но не имеющие электронной начинки.

        Получая такой протез не стоит рассчитывать на удобство хождения с ним. Косметические протезы чаще всего тяжелые и не выполняют никакой полезной функции в быту, на работе и в других условиях где требуется активное взаимодействия с окружающим миром.
    `,
    image_2: image2,
    title_2: "Протезы с управлением от тела человека",
    paragraph_2: `Такие протезы ещё называют тяговым/ функциональным. Этот протез полностью управляется человеком без использования электроники. Он позволяет удерживать различные предметы с помощью искусственной кисти.

        Тяговый протез оснащен механическими тросиками, которые позволяют сжимать и разжимать кисть. Такие протезы могут быть изготовлены для различных видов ампутаций.

        Протез "МОДЕСТА 1.0", разработанный в нашей компании, является наиболее совершенным и функционально активным, тяговым протезом с “захватом” вместо кисти копирующий руку человека.

        Качество такого протеза определяется раскрытием пальцев, силой хвата и легкостью открытия.
    `,
    image_3: image3,
    title_3: "Биоэлектрические",
    paragraph_3: `Биоэлектрические протезы или протезы с внешним источником энергии, используют энергию от аккумуляторной батареи и электрических двигателей, которые управляются электрическими сигналами от кожи пациента (датчиков ЭМГ).

        Самые современные модели характеризуются внешним видом копирующими руку человека, со средней силой и низкой скоростью выполнения движений, а также некоторые модели обладают несколькими сменными видами хватов.

        Есть возможность дополнить такой протез особыми сенсорными датчиками (тензодатчики), которые регулируют силу сжатия объекта, позволяя удерживать как пластиковый стаканчик, так и, например, куриное яйцо. Компания modesta.tech на данный момент только разрабатывает протезы с внешним источником энергии, включая те, которые предназначены для замещения утраченных конечностей.
    `,
    image_4: image4,
    title_4: "Детское протезирование",
    paragraph_4: `Детское протезирование имеет огромное значение, поскольку позволяет детям с физическими отклонениями развиваться и принимать активное участие в повседневной жизни. Вот несколько примеров значимости детского протезирования:

        1. Физическое развитие: Протезы способствуют развитию двигательных навыков и улучшению координации движений у детей.
        2. Социальная адаптация: Использование протеза может способствовать легкой адаптации детей в школе и других социальных средах.
        3. Психомоторное развитие: Протезы, особенно игрового характера, могут стимулировать развитие моторики и воображения у детей.
        4. Повседневная активность: Дети с протезами могут участвовать в различных занятиях и играх, что содействует полноценному развитию личности.

        Протезирование рекомендуется начинать с очень малого возраста от 3 до 7 месяцев. Дети подготовлены к использованию протезов для верхних конечностей, когда начинают сидеть и активно пользоваться обеими руками. Преимущества раннего протезирования заключаются в формировании привычки, расширении диапазона движений в суставах поврежденной руки и симметричном развитии мышц верхнего плечевого пояса. Чем раньше ребенок начинает использовать протез, тем короче период адаптации, и тем вероятнее он будет постоянно им пользоваться в будущем.
    `,
  },
};
