import React from "react";
import styles from "./BooksBlock.module.css";
import { GridBlock } from "../GridBlock/GridBlock";

const booksContent = [
  {
    name: "“Прикладная электрофизиология”",
    description:
      "Полезна для тех кому интересно получить базовое понимание как работает биоэлектрический протез. Важно отметить наличие экспериментов и лабораторных работ, которые может повторить практически каждый.",
    link: "https://ntcontest.ru/upload/iblock/b9b/b9b6120243ba5603f9ccc71b60b87c77.pdf",
  },

  {
    name: "“Ампутации конечностей и протезы” Н. Н. Приоров (1941 год)",
    description:
      "Описанные знания о ампутации и последующего протезирования актуальны по сегодняшний день. Данную работу можно считать классикой презостроения.",
    link: "https://www.booksite.ru/fulltext/174869/text.pdf",
  },
  {
    name: "“Погружение в мир электрофизиологии”",
    description:
      "Подробное описания работы механизмов мышечного сокращения, с лабораторными работами.",
    link: "https://kpfu.ru/staff_files/F_832641285/glava_2_sinaps_i_myshca__2_.pdf",
  },
  {
    name: "“Вот они – роботы” А. Е. Кабринский (1972 год)",
    description:
      "Описание некого симбиоза человека и робота, который рождает такие продукты как современные биоэлектрические протезы.",
    link: "https://sheba.spb.ru/za/vot-roboty-1972.htm",
  },

  {
    name: "“Антропология киборга – Антон Круглов” (2023 год)",
    description:
      "Работа Антона Круглова заслуживающая внимания, полезный труд, знания которого можно брать и применять сразу после прочтения. Уделяется часть книги психологическому аспекту, техническим моментам и примерам пациентов.",
    link: "https://static.insales-cdn.com/files/1/7512/26582360/original/antropologia_kiborga_sod_i_primeri_str_compressed.pdf",
  },
  {
    name: "“DESIGN OF AN EXTERNALLY POWERED ARTIFICIAL ELBOW FOR ELECTROMYOGRAPHIC CONTROL” (1965 год)",
    description:
      "Описание разработки протеза локтя с управлением при помощи электромиографии. В документе приложены принципиальные электрические схемы, чертежи элементов протеза.",
    link: "https://dspace.mit.edu/bitstream/handle/1721.1/150524/25500791-MIT.pdf",
  },
  {
    name: "“Рука Юты”",
    description:
      "Оригинальная статья с подробным математическим описанием принципа работы. Полезно для начинающих протезостроителей.",
    link: "https://dl.acm.org/doi/pdf/10.1145/800182.810395",
  },

  {
    name: "“BIOELECTRIC CONTROL OF PROSTHESES” (1966 год)",
    description:
      "Cтроение протеза методом управления от датчиков ЭМГ. Способы управления таким протезом. Возможность получать обратную связь от протеза. Перспективы развития протезов в будущем",
    link: "https://dspace.mit.edu/bitstream/handle/1721.1/4297/RLE-TR-446-04743378.pdf",
  },

  {
    name: "“Making Hands: A History of Prosthetic Arms” (1919 год)",
    description: "Первая в мире книга, руководство по протезированию.",
    link: "https://books.google.ru/books?id=EID-DwAAQBAJ&pg=PA147&lpg=PA147&dq=Peter+Kyberd+Making+Hands+free&source=bl&ots=HPErdUUTNm&sig=ACfU3U2ql7dWWOWYaeXTmEY4LNm_3-NQHA&hl=ru&sa=X&ved=2ahUKEwiU_IT7r8mDAxX1PxAIHXdXCnw4UBDoAXoECAIQAw#v=onepage&q&f=false",
  },
];

const BookContent = ({ item }) => {
  return <a target="_blank" className={styles["books__item-wrapper"]} href={item.link}>
    <div className={styles.books__img}>
      <svg
        x="0px"
        y="0px"
        className={styles.books__svg}
        viewBox="0 0 122.88 101.37"
      >
        <g>
          <path d="M12.64,77.27l0.31-54.92h-6.2v69.88c8.52-2.2,17.07-3.6,25.68-3.66c7.95-0.05,15.9,1.06,23.87,3.76 c-4.95-4.01-10.47-6.96-16.36-8.88c-7.42-2.42-15.44-3.22-23.66-2.52c-1.86,0.15-3.48-1.23-3.64-3.08 C12.62,77.65,12.62,77.46,12.64,77.27L12.64,77.27z M103.62,19.48c-0.02-0.16-0.04-0.33-0.04-0.51c0-0.17,0.01-0.34,0.04-0.51V7.34 c-7.8-0.74-15.84,0.12-22.86,2.78c-6.56,2.49-12.22,6.58-15.9,12.44V85.9c5.72-3.82,11.57-6.96,17.58-9.1 c6.85-2.44,13.89-3.6,21.18-3.02V19.48L103.62,19.48z M110.37,15.6h9.14c1.86,0,3.37,1.51,3.37,3.37v77.66 c0,1.86-1.51,3.37-3.37,3.37c-0.38,0-0.75-0.06-1.09-0.18c-9.4-2.69-18.74-4.48-27.99-4.54c-9.02-0.06-18.03,1.53-27.08,5.52 c-0.56,0.37-1.23,0.57-1.92,0.56c-0.68,0.01-1.35-0.19-1.92-0.56c-9.04-4-18.06-5.58-27.08-5.52c-9.25,0.06-18.58,1.85-27.99,4.54 c-0.34,0.12-0.71,0.18-1.09,0.18C1.51,100.01,0,98.5,0,96.64V18.97c0-1.86,1.51-3.37,3.37-3.37h9.61l0.06-11.26 c0.01-1.62,1.15-2.96,2.68-3.28l0,0c8.87-1.85,19.65-1.39,29.1,2.23c6.53,2.5,12.46,6.49,16.79,12.25 c4.37-5.37,10.21-9.23,16.78-11.72c8.98-3.41,19.34-4.23,29.09-2.8c1.68,0.24,2.88,1.69,2.88,3.33h0V15.6L110.37,15.6z M68.13,91.82c7.45-2.34,14.89-3.3,22.33-3.26c8.61,0.05,17.16,1.46,25.68,3.66V22.35h-5.77v55.22c0,1.86-1.51,3.37-3.37,3.37 c-0.27,0-0.53-0.03-0.78-0.09c-7.38-1.16-14.53-0.2-21.51,2.29C79.09,85.15,73.57,88.15,68.13,91.82L68.13,91.82z M58.12,85.25 V22.46c-3.53-6.23-9.24-10.4-15.69-12.87c-7.31-2.8-15.52-3.43-22.68-2.41l-0.38,66.81c7.81-0.28,15.45,0.71,22.64,3.06 C47.73,78.91,53.15,81.64,58.12,85.25L58.12,85.25z" />
        </g>
      </svg>
    </div>
    <p className={styles["books__item-info"]}>
      <span
        itemProp="disambiguatingDescription"
        className={styles["books__item-name"]}
      >
        {item.name}
      </span>
      <span className={styles["books__item-description"]}>
        {item.description}
      </span>
    </p>
  </a>;
};

export const BooksBlock = () => {
  return (
    <GridBlock
      title="Библиотека"
      id="books"
      clickable
      description={'Мы собрали для вас полезные материалы о протезировании, доступные для скачивания'}
      content={booksContent}
      renderItem={(item) => <BookContent item={item}/>}
    />
  );
};
