/* lawsContent содержит информацию о полезных нормативно-правовых актах в области социальной защиты. В этом объекте содержатся следующие данные:
title: “Законодательство” - общее название для блока (заголовок).
description: Краткое описание блока.
blocks: Массив объектов, каждый из которых представляет отдельный документ. Каждый объект имеет следующую информацию:
title: Название документа.
link: Ссылка на документ. */

export const lawsContent = {
    title: "Законодательство",
    description:
      "Полезные нормативно-правовые акты в области социальной защиты и поддержки населения",
    blocks: [
      {
        title:
          `Приказ Министерства труда и социальной защиты РФ от 20 августа 2018 г. N 529н Об утверждении разъяснения о порядке оплаты дополнительных расходов на медицинскую`,
        link: "https://disk.yandex.ru/i/yFfG0eQtHoACvQ",
      },
      {
        title:
          "Распоряжение Правительства РФ от 30 декабря 2005 г. N 2347-р «Об утверждении федерального перечня реабилитационных мероприятий",
        link: "https://disk.yandex.ru/i/yz0tVOZTa97NzA",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 13 февраля 2018 г N 86н",
        link: "https://disk.yandex.ru/i/DKuyM--3r3MXQg",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 5 марта 2021 г N 107н",
        link: "https://disk.yandex.ru/i/gQWJ-NukvOGOaQ",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 30 августа 2019 г. N 605н «Об утверждении Порядка осуществления уполномоченным органом медико-технической экспертизы",
        link: "https://disk.yandex.ru/i/Nr4BnuKydLs8Fg",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 23 июля 2019 г. N 521н Об утверждении перечня технических средств реабилитации, протезов и протезно-ортопедиче",
        link: "https://disk.yandex.ru/i/BM6ectNSKFz85A",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 3 декабря 2018 г. N 765 Об утверждении методических рекомендаций по определению потребности инвалида, ребенка",
        link: "https://disk.yandex.ru/i/xMVBv9pylFvilg",
      },
  
      {
        title:
          "Приказ Фонда социального страхования Российской Федерации от 16 мая 2019 г. № 256",
        link: "https://disk.yandex.ru/i/LF2FlPFbrlR93Q",
      },
  
      {
        title:
          "Приказ Фонда социального страхования РФ от 14 мая 2019 г. N 252 «Об утверждении Административного регламента Фонда социального страхования Российской Федерации...",
        link: "https://disk.yandex.ru/i/JRidWTqSdoXLng",
      },
  
      {
        title:
          "2. Федеральный закон от 24 ноября 1995 г. № 181-ФЗ О социальной защите инвалидов в Российской Федерации_",
        link: "https://disk.yandex.ru/i/wHibmmFht6jQ6Q",
      },
      {
        title:
          "Федеральный закон от 15 мая 2012 г. № 46-ФЗ О ратификации конвенции о правах инвалидов",
        link: "https://disk.yandex.ru/i/EP5xsr41aYvxWw",
      },
      {
        title:
          "Приказ Министерства труда и социальной защиты РФ от 26 июля 2023 г. N 603н",
        link: "https://disk.yandex.ru/i/uPZ5j-SbY2lVIA",
      },
  
      {
        title:
          "20. Приказ Министерства здравоохранения и социального развития Российской Федерации от 21 августа 2008 г. № 439н «Об утверждении форм уведомления о постановке на учет",
        link: "https://disk.yandex.ru/i/TB_GwqrGY38Ueg",
      },
      {
        title:
          "21. Федеральный закон от 30 декабря 2020 г N 491 ФЗ О приобретении отдельных",
        link: "https://disk.yandex.ru/i/O4Q5kEqnUDLjCA",
      },
      {
        title: "22. Постановление Правительства РФ от 29 апреля 2021 г N 678",
        link: "https://disk.yandex.ru/i/hXrQWPz_-vNLIQ",
      },
      {
        title: "23. Постановление Правительства РФ от 23 апреля 2021 г N 630",
        link: "https://disk.yandex.ru/i/wganFOAfTVxPTQ",
      },
      {
        title: "24. Постановление Правительства РФ от 4 мая 2021 г N 695",
        link: "https://disk.yandex.ru/i/JGKI4sRmMGXjzg",
      },
      {
        title:
          "3. Постановление Правительства РФ от 05.04.2022 N 588 О признании лица инвалидом",
        link: "https://disk.yandex.ru/i/N534XoTFNZZcEg",
      },
      {
        title:
          "4. Приказ Министерства труда и социальной защиты РФ от 27 апреля 2023 г. N 342н",
        link: "https://disk.yandex.ru/i/zbRfEpx7cVaySQ",
      },
      {
        title:
          "5. Приказ Министерства труда и социальной защиты РФ от 26 июня 2023 г. N 545н",
        link: "https://disk.yandex.ru/i/aoKGjCGDFGuTHg",
      },
      {
        title:
          "6. Федеральный закон от 24 июля 1998 г. N 125-ФЗ Об обязательном социальном страховании от несчастных случаев на производстве и профессиональных заболеваний_",
        link: "https://disk.yandex.ru/i/KduoWz_7jv7Oyg",
      },
      {
        title: "7. Федеральный закон от 12 января 1995 г. № 5-ФЗ О ветеранах_",
        link: "https://disk.yandex.ru/i/beXhfVx38ZDbSA",
      },
  
      {
        title:
          "8. Постановление Правительства РФ от 7 апреля 2008 г. N 240 «О порядке обеспечения инвалидов техническими средствами",
        link: "https://disk.yandex.ru/i/fav24G5ozBWQ8Q",
      },
      {
        title: "9. Постановление Правительства РФ от 15 мая 2006 г. N 286",
        link: "https://disk.yandex.ru/i/XCWxFm_vHyFZaA",
      },
    ],
  };