/* missionContent содержит информацию о миссии или целях определенной компании или организации. 
В данном случае речь идет о создании качественных функциональных протезов. 
Этот объект включает следующую информацию:
title: общая формулировка миссии компании
description: подробное объяснение миссии и целей компании, включая информацию о продуктах и услугах, которые они предлагают, 
а также о том, какую пользу они приносят своим клиентам и обществу в целом. */

export const missionContent = {
    title: "Создаём качественные функциональные протезы",
    description: `Мы специализируемся на разработке протезов для верхних конечностей, 
    включая модели тягового и биоэлектрического типа.
  
    Наши изделия помогают вернуть утраченные возможности, 
    улучшить функциональность и комфорт, позволяют активно участвовать в повседневных занятиях, 
    работе и социальной жизни.
  
    Разрабатывая наши прототипы, мы решаем сложные задачи,
     связанные с функциональностью, хватательной силой, практичностью и долговечностью протезов, 
     а так же обеспечиваем высокий уровень в реабилитации. 
    Мы предоставляем оптимальные решения для адаптации и качества жизни`,
  };