import React, { useEffect, useState } from "react";
import { VisibilityManager } from "../components/VisibilityManager.jsx";
import Layout from "../components/Layout/Layout.js";
import { useYandexRobot } from "../hooks/useYandexMetricsPageLoaded.jsx";
import { useRouter } from "next/router.js";
import { NewsFeed } from "../components/NewsFeed/NewsFeed.jsx";
import { PreviewBlock } from '../components/PreviewBlock/PreviewBlock.jsx';
import newsBack from '../public/images/news.webp';

export default function NewsPage() {
  const router = useRouter();
  const [popupOpened, setOpened] = useState(false);

  useEffect(() => {
    useYandexRobot(router.pathname);
  }, []);

  const metaConfig = {
    seoContent: `Свежие события и достижения компании Модеста

Текущие разработки:
✓ Инновационные технологии
✓ Улучшение функциональности
✓ Новые модели протезов

Достижения компании:
• Участие в выставках
• Научные исследования
• Отзывы пользователей

Разработка плечевого механизма:
✓ Установка редукторного корпуса
✓ Тестирование грузоподъемности
✓ Оценка нагрузочных характеристик (3 кг)

Проектирование и создание плеч:
✓ Разработка зубчатых механизмов
✓ Проектирование редуктора
✓ Прототипирование с использованием 3D-принтера с последующей доработкой

Комплекс манипуляторов:
✓ Создание схемы размещения рук
✓ Проектирование приводов и редукторов
✓ Завершение сборки конечностей

Создание базовой платформы:
✓ Изготовление корпусных деталей
✓ Монтаж и пайка компонентов
✓ Компоновка несущей структуры

Формирование каркаса:
✓ Установка рамной системы
✓ Интеграция позвоночного блока
✓ Полная сборка всех компонентов

Первые этапы разработки:
✓ Обновление технической документации
✓ Конструирование верхних конечностей
✓ Размещение механических узлов

Финальные этапы:
✓ Создание верхней платформы
✓ Установка системы управления
✓ Решение технических задач

Электронные компоненты:
✓ Установка батарейных модулей
✓ Монтаж преобразователей тока
✓ Подключение датчиков расстояния
✓ Установка системы охлаждения

Завершение сборки:
✓ Финальная обработка корпуса
✓ Выравнивание и шлифовка
✓ Подготовка креплений для электроники

Демонстрационная модель:
✓ Сборка алюминиевого каркаса
✓ Оценка временных затрат
✓ Реализация в течение 100 дней

#роботРеабилитолог #разработкаРоботов #роботВертер #медицинскиеРоботы #инновационныеТехнологии #робототехникаМедицина #сборкаРоботов #бионическиеПротезы #реабилитационныеТехнологии #российскиеРазработки`,
    title: "Новости компании Модеста | Прогресс в протезировании",
    description: "Актуальные новости о разработках, успехах и мероприятиях компании Модеста. Следите за развитием технологий протезирования.",
    keywords: "новости протезирование, разработки модеста, технологии протезов, достижения компании, инновации будущего",
  };
  return (
    <Layout  metaConfig={metaConfig} popupOpened={popupOpened} setOpened={setOpened}>
      <VisibilityManager side="opacity">
      <PreviewBlock img={newsBack.src} title={'Новости'} />

        <NewsFeed />
      </VisibilityManager>
    </Layout>
  );
}
